
INSERT INTO transaction (type, amount, description, transaction_date) VALUES
('credit', 15000, 'משכורת', '2024-01-01'),
('credit', 300, 'זכייה בפיס', '2024-01-06'),
('debit', -130.56, 'חיוב אשראי', '2024-01-01'),
('Debit', -1000, 'הורדת צק', '2024-01-03'),
('debit', -235.60, 'חיוב אשראי', '2024-01-01'),
('debit', -100, 'עמלה', '2024-01-02'),
('debit', -1000, 'משיכת מזומן', '2024-01-03'),
('credit', 15432, 'משכורת', '2024-02-01'),
('credit', 5000, 'העברה מאמא', '2024-02-10'),
('debit', -130.56, 'חיוב אשראי', '2024-02-01'),
('debit', -2456, 'הורדת צק', '2024-02-03'),
('debit', -235.60, 'חיוב אשראי', '2024-02-01'),
('debit', -93.43, 'עמלה', '2024-02-02'),
('debit', -1234, 'משיכת מזומן', '2024-02-03');
